maxgerhardt/micropython/ports/ch32/machine_i2s.c
/* machine.I2S on the SAI peripheral.
 *
 * The hardware half of MicroPython's I2S class; extmod/machine_i2s.c owns the
 * Python-facing behaviour, the ring buffer and the blocking / non-blocking /
 * asyncio modes, and includes this file. A port supplies only the object
 * struct and the four mp_machine_i2s_* entry points at the bottom.
 *
 * This uses SAI, NOT the peripherals the datasheet calls I2S2 and I2S3, and
 * that is deliberate. I2S2/I2S3 hang off SPI2/SPI3, and every pin either can
 * reach is in the VIO18 domain, which this board runs at about 1.2 V. That
 * cannot meet the input threshold of a 3.3 V audio device, and the device's
 * 3.3 V output into a 1.2 V pad is a large overdrive. SAI block A reaches
 * PE4/PE5/PE6, which are in the 3.3 V domain -- PE2, PE5 and PE6 measured
 * directly, see docs/hw/ch32h417-notes.md. Hence SAI, despite the names.
 */

/* stdlib.h is for abs(), which extmod/machine_i2s.c uses but does not include a
 * header for. It gets away with it on toolchains that declare abs() as a
 * builtin; CH32_TOOLCHAIN=generic does not, and the implicit declaration is an
 * error there. This file is included into that one, so declaring it here is
 * enough and keeps the fix in the port rather than in shared code. */
#include <stdlib.h>
#include <string.h>

#include "py/mphal.h"
#include "py/runtime.h"

#include "ch32h417.h"
#include "irq.h"
#include "machine_pin.h"

/* Two SAI blocks. Block A is the one broken out to 3.3 V pins here; block B's
 * clock and frame-sync pins are all VIO18, so it is only useful synchronous to
 * A -- sharing A's SCK/FS and needing just its own data pin PE3 -- or with
 * level shifting. */
#define MAX_I2S_CH32 (2)

/* DMA buffer, halved and serviced from the half-transfer and transfer-complete
 * interrupts so the DMA always owns one half while the other is copied. At
 * 48 kHz stereo 32-bit -- the fastest configuration here, 384 kB/s -- each half
 * lasts about 340 us, a comfortable interrupt rate and a small latency. */
#define SIZEOF_DMA_BUFFER_IN_BYTES (512)
#define SIZEOF_HALF_DMA_BUFFER_IN_BYTES (SIZEOF_DMA_BUFFER_IN_BYTES / 2)

/* DMA1 channels 2 and 3 belong to machine.SPI; 4 and 5 are free. One channel
 * per block is enough: an I2S object is either RX or TX, never both. */
#define I2S_DMA_A_FLAGS      ((uint32_t)0x0000F000)   // channel 4 nibble
#define I2S_DMA_A_HT         ((uint32_t)0x00004000)
#define I2S_DMA_B_FLAGS      ((uint32_t)0x000F0000)   // channel 5 nibble
#define I2S_DMA_B_HT         ((uint32_t)0x00040000)

/* DMAMUX request numbers, reference manual table 10-2. */
#define I2S_DMA_REQ_A_TX     (112)
#define I2S_DMA_REQ_A_RX     (113)
#define I2S_DMA_REQ_B_TX     (114)
#define I2S_DMA_REQ_B_RX     (115)

// MCKDIV is 6 bits; see i2s_set_rate() for what that costs at low rates.
#define I2S_MCKDIV_MAX (63)

/* In non-blocking mode the ring buffer is drained/filled faster than the DMA
 * moves data, so a slow caller cannot make it underflow. */
#define NON_BLOCKING_RATE_MULTIPLIER (4)
#define SIZEOF_NON_BLOCKING_COPY_IN_BYTES (SIZEOF_HALF_DMA_BUFFER_IN_BYTES * NON_BLOCKING_RATE_MULTIPLIER)

/* Receive always captures 32-bit stereo, whatever the user asked for, and
 * extmod/machine_i2s.c reshapes it on the way out through this map. So the
 * ring buffer always holds 8-byte frames on the RX side, and -1 means "this
 * output byte comes from nowhere". */
static const int8_t i2s_frame_map[NUM_I2S_USER_FORMATS][I2S_RX_FRAME_SIZE_IN_BYTES] = {
    { -1, -1,  0,  1, -1, -1, -1, -1 },  // Mono, 16-bit
    {  0,  1,  2,  3, -1, -1, -1, -1 },  // Mono, 32-bit
    { -1, -1,  0,  1, -1, -1,  2,  3 },  // Stereo, 16-bit
    {  0,  1,  2,  3,  4,  5,  6,  7 },  // Stereo, 32-bit
};

static int8_t get_frame_mapping_index(int8_t bits, format_t format) {
    if (format == MONO) {
        return bits == 16 ? 0 : 1;
    }
    return bits == 16 ? 2 : 3;
}

/* Owned by the port rather than extmod, and named by mpconfigport.h through
 * MICROPY_PY_MACHINE_I2S_CONSTANT_RX/TX to reach the Python-visible I2S.RX and
 * I2S.TX. */
typedef enum {
    RX,
    TX
} i2s_mode_t;

typedef struct _i2s_pin_t {
    mp_hal_pin_obj_t pin;
    uint8_t af;
} i2s_pin_t;

typedef struct _machine_i2s_obj_t {
    mp_obj_base_t base;
    uint8_t i2s_id;
    mp_hal_pin_obj_t sck;
    mp_hal_pin_obj_t ws;
    mp_hal_pin_obj_t sd;
    i2s_mode_t mode;
    int8_t bits;
    format_t format;
    int32_t rate;
    int32_t ibuf;
    mp_obj_t callback_for_non_blocking;
    io_mode_t io_mode;
    SAI_Block_TypeDef *block;
    DMA_Channel_TypeDef *dma;
    uint32_t dma_flags;
    uint32_t dma_ht_flag;
    IRQn_Type dma_irqn;
    int32_t actual_rate;              // what the divider could really produce
    uint8_t dma_buffer[SIZEOF_DMA_BUFFER_IN_BYTES];
    ring_buf_t ring_buffer;
    uint8_t *ring_buffer_storage;
    non_blocking_descriptor_t non_blocking_descriptor;
} machine_i2s_obj_t;

static machine_i2s_obj_t *machine_i2s_active[MAX_I2S_CH32];

/******************************************************************************/
// Pin tables
//
// Only the port E options are offered for block A. The datasheet also allows
// PC0-PC3, PB2 and PD6, but those are VIO18 pins where a 3.3 V audio device
// does not work -- listing them would only be a way to lose an afternoon.

static const i2s_pin_t i2s_sck_pins_a[] = { { &pin_E5_obj, GPIO_AF6 } };
static const i2s_pin_t i2s_ws_pins_a[] = { { &pin_E4_obj, GPIO_AF6 } };
static const i2s_pin_t i2s_sd_pins_a[] = { { &pin_E6_obj, GPIO_AF6 } };

/* Block B runs SYNCHRONOUS to block A: it takes SCK and FS from A over an
 * internal path and drives no clock pins of its own. Its own SCK/FS options are
 * PA14/PA15, which are VIO18 and therefore useless here anyway.
 *
 * So B is constructed with the SAME sck and ws pins as A -- they name the
 * shared clocks rather than pins B configures -- and only its data pin, PE3,
 * belongs to it. That is what makes full duplex cost one extra wire. */
static const i2s_pin_t i2s_sck_pins_b[] = { { &pin_E5_obj, GPIO_AF6 } };
static const i2s_pin_t i2s_ws_pins_b[] = { { &pin_E4_obj, GPIO_AF6 } };
static const i2s_pin_t i2s_sd_pins_b[] = { { &pin_E3_obj, GPIO_AF6 } };

static uint8_t i2s_find_af(const i2s_pin_t *table, size_t len, mp_hal_pin_obj_t pin) {
    for (size_t i = 0; i < len; i++) {
        if (table[i].pin == pin) {
            return table[i].af;
        }
    }
    mp_raise_ValueError(MP_ERROR_TEXT("pin cannot be used for this I2S signal"));
    return 0;
}

/* The data pin must be a FLOATING input when receiving. Do not "improve" this
 * into a pulled input.
 *
 * Reference manual table 9-6 says a pull is allowed -- "I2Sx_SD Receiver:
 * Floating input or pull-up or pull-down input" -- and on this silicon that is
 * wrong. Configuring PE6 as input-with-pull (CNF=10) leaves the pad working,
 * measurably: it still follows the microphone and still toggles. But the SAI
 * then samples nothing and every captured word is zero. Only CNF=01, floating
 * input, routes the pad to the peripheral.
 *
 * That matters because an I2S microphone tri-states SD whenever it is not
 * driving its own channel -- the INMP441 drives 24 bits of a 32-bit slot and
 * lets go for the last 8 -- and a floating input holds the last level on pin
 * capacitance, so those 8 bits read back as a copy of bit 8 rather than zero.
 * The microphone's datasheet asks for a 100k pulldown on the SD trace for
 * exactly this reason. It has to be an external resistor here; mask the low 8
 * bits in software otherwise. */
static void i2s_pin_init(mp_hal_pin_obj_t pin, uint8_t af, bool is_input) {
    machine_pin_clock_enable(pin->id);
    /* GPIO_PinAFConfig writes land in the AFIO block and are silently dropped
     * while its clock is off. */
    RCC_HB2PeriphClockCmd(RCC_HB2Periph_AFIO, ENABLE);
    (void)RCC->HB2PCENR;

    GPIO_InitTypeDef init = { 0 };
    init.GPIO_Pin = MACHINE_PIN_MASK(pin->id);
    init.GPIO_Speed = GPIO_Speed_Very_High;
    init.GPIO_Mode = is_input ? GPIO_Mode_IN_FLOATING : GPIO_Mode_AF_PP;
    GPIO_Init(machine_pin_gpio(pin->id), &init);

    GPIO_PinAFConfig(machine_pin_gpio(pin->id), MACHINE_PIN_NUM(pin->id), af);
}

/******************************************************************************/
// Clocking

