maxgerhardt/micropython/ports/ch32/machine_i2s.c
/* Bit clock is SAI_CK / (MCKDIV * 2) with the master-clock divider disabled,
 * which is the mode to use here: an INMP441-class microphone derives all its
 * timing from SCK and needs no MCLK at all.
 *
 * A stereo frame is two slots of `bits`, so SCK = rate * bits * 2.
 *
 * The divider is only 6 bits, so not every rate is reachable and none is
 * exact. The object reports what it actually got rather than echoing the
 * request -- print(i2s) shows both -- because silently running a fraction of a
 * percent fast is exactly the sort of thing that turns into a pitch-shifted
 * recording nobody can account for. */
/* Slot width the hardware actually runs at, which is not always what the user
 * asked for: receive is always 32-bit stereo, because extmod's frame map
 * expects 8-byte frames and narrows them itself. Transmit uses the requested
 * width directly. */
static uint8_t i2s_hw_bits(machine_i2s_obj_t *self) {
    return self->mode == RX ? 32 : (uint8_t)self->bits;
}

static uint32_t i2s_set_rate(machine_i2s_obj_t *self) {
    RCC_ClocksTypeDef clocks;
    RCC_GetClocksFreq(&clocks);
    uint32_t sai_ck = clocks.HCLK_Frequency;

    uint32_t sck = (uint32_t)self->rate * (uint32_t)i2s_hw_bits(self) * 2u;
    uint32_t div = (sai_ck + sck) / (2u * sck);   // rounded to nearest
    if (div == 0) {
        div = 1;
    }
    if (div > I2S_MCKDIV_MAX) {
        /* Below roughly 12 kHz at a 100 MHz SAI clock the divider runs out.
         * Refusing beats quietly delivering a different sample rate. */
        mp_raise_ValueError(MP_ERROR_TEXT("rate too low"));
    }

    self->actual_rate = (int32_t)(sai_ck / (2u * div) / ((uint32_t)i2s_hw_bits(self) * 2u));
    return div;
}

/******************************************************************************/
// DMA

/* Receive: raw bytes straight into the ring buffer. No format conversion here
 * -- the hardware is always 32-bit stereo on this path and i2s_frame_map does
 * the reshaping later. Dropping the whole half when it will not fit is
 * deliberate: a partial frame would desynchronise left from right for every
 * sample after it. */
static void i2s_empty_dma(machine_i2s_obj_t *self, uint8_t *half) {
    if (ringbuf_available_space(&self->ring_buffer) >= SIZEOF_HALF_DMA_BUFFER_IN_BYTES) {
        for (uint32_t i = 0; i < SIZEOF_HALF_DMA_BUFFER_IN_BYTES; i++) {
            ringbuf_push(&self->ring_buffer, half[i]);
        }
    }
}

/* Transmit: the SAI always sends two slots, so a mono stream is written into
 * both of them -- otherwise it would come out of one channel only, at half the
 * expected rate. */
static void i2s_feed_dma(machine_i2s_obj_t *self, uint8_t *half) {
    if (ringbuf_available_data(&self->ring_buffer) < SIZEOF_HALF_DMA_BUFFER_IN_BYTES) {
        // Underflow: send silence rather than repeating whatever was here.
        memset(half, 0, SIZEOF_HALF_DMA_BUFFER_IN_BYTES);
        return;
    }

    if (self->format == MONO) {
        uint32_t sample = (uint32_t)self->bits / 8u;
        uint32_t frame = sample * 2u;
        for (uint32_t i = 0; i < SIZEOF_HALF_DMA_BUFFER_IN_BYTES / frame; i++) {
            for (uint32_t b = 0; b < sample; b++) {
                ringbuf_pop(&self->ring_buffer, &half[i * frame + b]);
                half[i * frame + sample + b] = half[i * frame + b];
            }
        }
    } else {
        for (uint32_t i = 0; i < SIZEOF_HALF_DMA_BUFFER_IN_BYTES; i++) {
            ringbuf_pop(&self->ring_buffer, &half[i]);
        }
    }
}

static void i2s_dma_irq_handler(uint8_t id) {
    machine_i2s_obj_t *self = machine_i2s_active[id];
    if (self == NULL) {
        return;
    }

    uint32_t flags = DMA1->INTFR & self->dma_flags;
    DMA1->INTFCR = self->dma_flags;

    /* Half-transfer means the DMA has finished the first half and moved to the
     * second, so the first half is ours; transfer-complete is the mirror of
     * that. Servicing the wrong half would race the DMA. */
    uint8_t *half = (flags & self->dma_ht_flag)
        ? &self->dma_buffer[0]
        : &self->dma_buffer[SIZEOF_HALF_DMA_BUFFER_IN_BYTES];

    if (self->mode == TX) {
        if (self->io_mode == NON_BLOCKING && self->non_blocking_descriptor.copy_in_progress) {
            copy_appbuf_to_ringbuf_non_blocking(self);
        }
        i2s_feed_dma(self, half);
    } else {
        i2s_empty_dma(self, half);
        if (self->io_mode == NON_BLOCKING && self->non_blocking_descriptor.copy_in_progress) {
            fill_appbuf_from_ringbuf_non_blocking(self);
        }
    }
}

void CH32_IRQ_HANDLER(DMA1_Channel4_IRQHandler);
void DMA1_Channel4_IRQHandler(void) {
    i2s_dma_irq_handler(0);
}

void CH32_IRQ_HANDLER(DMA1_Channel5_IRQHandler);
void DMA1_Channel5_IRQHandler(void) {
    i2s_dma_irq_handler(1);
}

static void i2s_dma_init(machine_i2s_obj_t *self) {
    RCC_HBPeriphClockCmd(RCC_HBPeriph_DMA1, ENABLE);
    (void)RCC->HBPCENR;

    DMA_Cmd(self->dma, DISABLE);
    DMA1->INTFCR = self->dma_flags;

    DMA_InitTypeDef init = { 0 };
    init.DMA_PeripheralBaseAddr = (uint32_t)&self->block->DATAR;
    init.DMA_Memory0BaseAddr = (uint32_t)self->dma_buffer;
    init.DMA_DIR = (self->mode == RX) ? DMA_DIR_PeripheralSRC : DMA_DIR_PeripheralDST;
    /* The SAI data register is 32 bits wide whatever the slot size, so the DMA
     * always moves words; the buffer length is in transfers, not bytes. */
    init.DMA_BufferSize = SIZEOF_DMA_BUFFER_IN_BYTES / 4;
    init.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    init.DMA_MemoryInc = DMA_MemoryInc_Enable;
    init.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Word;
    init.DMA_MemoryDataSize = DMA_MemoryDataSize_Word;
    init.DMA_Mode = DMA_Mode_Circular;
    init.DMA_Priority = DMA_Priority_VeryHigh;
    init.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(self->dma, &init);

    uint8_t req;
    if (self->i2s_id == 0) {
        req = (self->mode == RX) ? I2S_DMA_REQ_A_RX : I2S_DMA_REQ_A_TX;
        DMA_MuxChannelConfig(DMA_MuxChannel4, req);
    } else {
        req = (self->mode == RX) ? I2S_DMA_REQ_B_RX : I2S_DMA_REQ_B_TX;
        DMA_MuxChannelConfig(DMA_MuxChannel5, req);
    }

