maxgerhardt/micropython/ports/ch32/machine_i2s.c
    DMA_ITConfig(self->dma, DMA_IT_TC | DMA_IT_HT, ENABLE);
    NVIC_SetPriority(self->dma_irqn, 2);
    NVIC_EnableIRQ(self->dma_irqn);
    DMA_Cmd(self->dma, ENABLE);
}

/******************************************************************************/
// SAI

/* Clear the sticky status flags. CLRFR sits at block offset 0x18, which the
 * SDK's SAI_Block_TypeDef declares as RESERVED0 and provides no accessor for,
 * hence the pointer arithmetic. Writing a 1 clears the corresponding flag;
 * 0x77 covers all of them. The frame-sync errors in particular latch and never
 * clear themselves, so a block that once saw a bad frame stays broken. */
static void i2s_clear_flags(SAI_Block_TypeDef *block) {
    volatile uint32_t *clrfr = (volatile uint32_t *)((uintptr_t)block + 0x18);
    *clrfr = 0x77;
}

static void i2s_sai_init(machine_i2s_obj_t *self) {
    RCC_HB2PeriphClockCmd(RCC_HB2Periph_SAI, ENABLE);
    (void)RCC->HB2PCENR;

    SAI_Cmd(self->block, DISABLE);

    /* Block A is the master and owns the clock pins. Block B is synchronous to
     * it: slave mode plus SYNCEN, so it takes SCK and FS over the internal
     * path rather than generating or receiving them on pins. A block B on its
     * own, with no block A running, therefore has no clock and will not
     * transfer -- which is the correct behaviour to expose, since its own
     * clock pins are in the unusable voltage domain. */
    bool sync = (self->i2s_id == 1);

    SAI_InitTypeDef init;
    if (sync) {
        init.SAI_AudioMode = (self->mode == RX) ? SAI_Mode_SlaveRx : SAI_Mode_SlaveTx;
    } else {
        init.SAI_AudioMode = (self->mode == RX) ? SAI_Mode_MasterRx : SAI_Mode_MasterTx;
    }
    init.SAI_Protocol = SAI_Free_Protocol;
    init.SAI_DataSize = (i2s_hw_bits(self) == 16) ? SAI_DataSize_16b : SAI_DataSize_32b;
    init.SAI_FirstBit = SAI_FirstBit_MSB;
    /* I2S drives data on the falling edge and samples on the rising edge, so a
     * receiver strobes rising and a transmitter falling. */
    init.SAI_ClockStrobing = (self->mode == RX) ? SAI_ClockStrobing_RisingEdge
                                                : SAI_ClockStrobing_FallingEdge;
    init.SAI_Synchro = sync ? SAI_Synchronous : SAI_Asynchronous;
    init.SAI_OutDRIV = SAI_Output_NotReleased;
    // No master clock; disabling the divider is what puts SCK straight on MCKDIV.
    init.SAI_NoDivider = SAI_MasterDivider_Disabled;
    init.SAI_MasterDivider = i2s_set_rate(self);
    init.SAI_FIFOThreshold = SAI_FIFOThreshold_HalfFull;
    SAI_Init(self->block, &init);

    /* Philips I2S framing: the frame is two slots wide, frame sync is low for
     * the left slot and lasts exactly half the frame, and data starts one bit
     * clock after the edge. */
    SAI_FrameInitTypeDef frame;
    frame.SAI_FrameLength = i2s_hw_bits(self) * 2;
    frame.SAI_ActiveFrameLength = i2s_hw_bits(self);
    frame.SAI_FSDefinition = I2S_FS_ChannelIdentification;
    /* Active low, because I2S holds WS low for the left channel and slot 0 is
     * the one that begins at the FS active edge. A microphone with L/R tied to
     * ground transmits in the left channel, so its data lands in slot 0 --
     * which is the slot MONO reads.
     *
     * This briefly looked wrong during bring-up: the data appeared in slot 1
     * and flipping the polarity appeared to fix it. It did not. The real fault
     * was the SAI being enabled before the DMA was armed, which let the
     * capture start half a frame late and swapped the slots; flipping the
     * polarity only cancelled that out, and only sometimes. Fix the ordering,
     * not the polarity -- see mp_machine_i2s_init_helper(). */
    frame.SAI_FSPolarity = SAI_FS_ActiveLow;
    frame.SAI_FSOffset = SAI_FS_BeforeFirstBit;
    SAI_FrameInit(self->block, &frame);

    SAI_SlotInitTypeDef slot;
    slot.SAI_FirstBitOffset = 0;
    slot.SAI_SlotSize = SAI_SlotSize_DataSize;
    slot.SAI_SlotNumber = 2;
    slot.SAI_SlotActive = SAI_SlotActive_0 | SAI_SlotActive_1;
    SAI_SlotInit(self->block, &slot);

    SAI_DMACmd(self->block, ENABLE);
    /* Deliberately NOT enabled here. The block is started only once the DMA is
     * armed -- see the ordering note in mp_machine_i2s_init_helper(). */
}

/******************************************************************************/
// Port entry points required by extmod/machine_i2s.c

static void mp_machine_i2s_init_helper(machine_i2s_obj_t *self, mp_arg_val_t *args) {
    mp_hal_pin_obj_t sck = args[ARG_sck].u_obj == MP_OBJ_NULL ? NULL : mp_hal_get_pin_obj(args[ARG_sck].u_obj);
    mp_hal_pin_obj_t ws = args[ARG_ws].u_obj == MP_OBJ_NULL ? NULL : mp_hal_get_pin_obj(args[ARG_ws].u_obj);
    mp_hal_pin_obj_t sd = args[ARG_sd].u_obj == MP_OBJ_NULL ? NULL : mp_hal_get_pin_obj(args[ARG_sd].u_obj);
    if (sck == NULL || ws == NULL || sd == NULL) {
        mp_raise_ValueError(MP_ERROR_TEXT("sck, ws and sd are required"));
    }

    i2s_mode_t mode = args[ARG_mode].u_int;
    if (mode != RX && mode != TX) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid mode"));
    }

    int8_t bits = args[ARG_bits].u_int;
    if (bits != 16 && bits != 32) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid bits"));
    }

    format_t format = args[ARG_format].u_int;
    if (format != MONO && format != STEREO) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid format"));
    }

    int32_t rate = args[ARG_rate].u_int;
    if (rate <= 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid rate"));
    }

    int32_t ring_buffer_len = args[ARG_ibuf].u_int;
    if (ring_buffer_len <= 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid ibuf"));
    }

    /* Everything is validated, and the pins resolved, before anything is
     * committed -- a bad argument leaves a working object untouched rather
     * than half reconfigured. */
    const i2s_pin_t *sck_tab = self->i2s_id == 0 ? i2s_sck_pins_a : i2s_sck_pins_b;
    const i2s_pin_t *ws_tab = self->i2s_id == 0 ? i2s_ws_pins_a : i2s_ws_pins_b;
    const i2s_pin_t *sd_tab = self->i2s_id == 0 ? i2s_sd_pins_a : i2s_sd_pins_b;
    uint8_t sck_af = i2s_find_af(sck_tab, 1, sck);
    uint8_t ws_af = i2s_find_af(ws_tab, 1, ws);
    uint8_t sd_af = i2s_find_af(sd_tab, 1, sd);

    self->ring_buffer_storage = m_new(uint8_t, ring_buffer_len);
    ringbuf_init(&self->ring_buffer, self->ring_buffer_storage, ring_buffer_len);

    self->sck = sck;
    self->ws = ws;
    self->sd = sd;
    self->mode = mode;
    self->bits = bits;
    self->format = format;
    self->rate = rate;
    self->ibuf = ring_buffer_len;
    self->callback_for_non_blocking = MP_OBJ_NULL;
    self->non_blocking_descriptor.copy_in_progress = false;
    self->io_mode = BLOCKING;
    memset(self->dma_buffer, 0, sizeof(self->dma_buffer));

    if (self->i2s_id == 0) {
        self->block = SAI_Block_A;
        self->dma = DMA1_Channel4;
        self->dma_flags = I2S_DMA_A_FLAGS;
        self->dma_ht_flag = I2S_DMA_A_HT;
        self->dma_irqn = DMA1_Channel4_IRQn;
    } else {
        self->block = SAI_Block_B;
        self->dma = DMA1_Channel5;
        self->dma_flags = I2S_DMA_B_FLAGS;
        self->dma_ht_flag = I2S_DMA_B_HT;
        self->dma_irqn = DMA1_Channel5_IRQn;
    }

    /* Block B does not own the clock pins -- block A drives them, and
     * reconfiguring them here would just fight it. Only its data pin is B's. */
    if (self->i2s_id == 0) {
        i2s_pin_init(sck, sck_af, false);
        i2s_pin_init(ws, ws_af, false);
    }
    i2s_pin_init(sd, sd_af, self->mode == RX);

    machine_i2s_active[self->i2s_id] = self;

