maxgerhardt/micropython/ports/ch32/machine_i2s.c
    /* Order matters, and getting it wrong is subtle. The SAI must be started
     * AFTER the DMA is armed. Enabling it first lets its FIFO begin filling in
     * the window before the DMA is running, so the first word the DMA collects
     * can be the second slot of a frame rather than the first -- and from then
     * on left and right are swapped for the life of the object. It is not even
     * consistently wrong: it depends on how long that window happens to be,
     * which is why MONO looked fine while STEREO came out reversed. */
    i2s_sai_init(self);
    i2s_dma_init(self);
    SAI_FlushFIFO(self->block);
    SAI_Cmd(self->block, ENABLE);

    /* A synchronous block must already be running when the master starts.
     * Block A is enabled the moment I2S(0) is constructed, so by the time
     * I2S(1) exists the frames are already flowing and block B meets its first
     * frame sync somewhere in the middle of one. It then latches AFSDET and
     * LFSDET -- anticipated and late frame sync -- and never transfers a
     * single word, which looks like a dead DMA rather than a timing problem.
     *
     * Restarting the master here puts the pair in the documented order:
     * synchronous block enabled first, master second. Doing it inside the
     * driver keeps it off the user, who would otherwise have to construct the
     * two objects in an order the API gives no hint about. */
    if (self->i2s_id == 1) {
        machine_i2s_obj_t *master = machine_i2s_active[0];
        if (master != NULL && master->block != NULL) {
            SAI_Cmd(master->block, DISABLE);
            SAI_Cmd(self->block, DISABLE);
            SAI_FlushFIFO(self->block);
            i2s_clear_flags(self->block);
            SAI_Cmd(self->block, ENABLE);
            SAI_Cmd(master->block, ENABLE);
        }
    }
}

static machine_i2s_obj_t *mp_machine_i2s_make_new_instance(mp_int_t i2s_id) {
    if (i2s_id < 0 || i2s_id >= MAX_I2S_CH32) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid id"));
    }

    machine_i2s_obj_t *self;
    if (MP_STATE_PORT(machine_i2s_obj[i2s_id]) == NULL) {
        self = mp_obj_malloc(machine_i2s_obj_t, &machine_i2s_type);
        MP_STATE_PORT(machine_i2s_obj[i2s_id]) = self;
        self->i2s_id = i2s_id;
        self->block = NULL;
    } else {
        self = MP_STATE_PORT(machine_i2s_obj[i2s_id]);
        mp_machine_i2s_deinit(self);
    }
    return self;
}

static void mp_machine_i2s_deinit(machine_i2s_obj_t *self) {
    // block doubles as the "is initialised" flag.
    if (self->block != NULL) {
        NVIC_DisableIRQ(self->dma_irqn);
        DMA_ITConfig(self->dma, DMA_IT_TC | DMA_IT_HT, DISABLE);
        DMA_Cmd(self->dma, DISABLE);
        SAI_Cmd(self->block, DISABLE);
        SAI_FlushFIFO(self->block);
        machine_i2s_active[self->i2s_id] = NULL;
        m_free(self->ring_buffer_storage);
        self->ring_buffer_storage = NULL;
        self->block = NULL;
    }
}

static void mp_machine_i2s_irq_update(machine_i2s_obj_t *self) {
    (void)self;
}

// Behind ch32.i2s_actual_rate(); see the comment there.
uint32_t machine_i2s_actual_rate(mp_int_t i2s_id) {
    if (i2s_id < 0 || i2s_id >= MAX_I2S_CH32) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid id"));
    }
    machine_i2s_obj_t *self = MP_STATE_PORT(machine_i2s_obj[i2s_id]);
    if (self == NULL || self->block == NULL) {
        return 0;
    }
    return (uint32_t)self->actual_rate;
}

MP_REGISTER_ROOT_POINTER(void *machine_i2s_obj[MAX_I2S_CH32]);
